In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [4]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [15]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.arange(24).reshape(6,4), index=dates, columns=list('ABCD'))
df

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [16]:
df.head() #头部

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19

In [17]:
df.tail(2) #尾部

             A   B   C   D
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [18]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [21]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19],
       [20, 21, 22, 23]])

In [20]:
df.describe()

               A          B          C          D
count   6.000000   6.000000   6.000000   6.000000
mean   10.000000  11.000000  12.000000  13.000000
std     7.483315   7.483315   7.483315   7.483315
min     0.000000   1.000000   2.000000   3.000000
25%     5.000000   6.000000   7.000000   8.000000
50%    10.000000  11.000000  12.000000  13.000000
75%    15.000000  16.000000  17.000000  18.000000
max    20.000000  21.000000  22.000000  23.000000

In [22]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A           0           4           8          12          16          20
B           1           5           9          13          17          21
C           2           6          10          14          18          22
D           3           7          11          15          19          23

In [25]:
df.sort_index(axis=0, ascending=False)

             A   B   C   D
2013-01-06  20  21  22  23
2013-01-05  16  17  18  19
2013-01-04  12  13  14  15
2013-01-03   8   9  10  11
2013-01-02   4   5   6   7
2013-01-01   0   1   2   3

In [26]:
df.sort_values(by='B')

             A   B   C   D
2013-01-01   0   1   2   3
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [28]:
df.A  #列选择（单）

2013-01-01     0
2013-01-02     4
2013-01-03     8
2013-01-04    12
2013-01-05    16
2013-01-06    20
Freq: D, Name: A, dtype: int32

In [49]:
df[['A','B']] #列选择（多）

             A   B
2013-01-01   0   1
2013-01-02   4   5
2013-01-03   8   9
2013-01-04  12  13
2013-01-05  16  17
2013-01-06  20  21

In [62]:
df.loc['20130102',]  #行选择（单）

A    4
B    5
C    6
D    7
Name: 2013-01-02 00:00:00, dtype: int32

In [66]:
#df.loc['20130102':'20130105',]
df[0:3]    #行选择（多）

            A  B   C   D
2013-01-01  0  1   2   3
2013-01-02  4  5   6   7
2013-01-03  8  9  10  11

In [33]:
df[-3:] #行选择（多）

             A   B   C   D
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [55]:
df.loc["2013-01-02":"2013-01-04",['C','D']]  #选择多行多列

             C   D
2013-01-02   6   7
2013-01-03  10  11
2013-01-04  14  15

In [120]:
df.loc['2013-01-04','B']    #选择单行单列  定位到某个值

13

In [73]:
df.at[dates[0],'B']    #快速选择到某个值

1

In [79]:
df.iloc[0:3,1:3]  #位置选择器

            B   C
2013-01-01  1   2
2013-01-02  5   6
2013-01-03  9  10

In [122]:
df.iloc[0,1]    #快速选择到某个值

1

In [80]:
df[df.A > 0]

             A   B   C   D
2013-01-02   4   5   6   7
2013-01-03   8   9  10  11
2013-01-04  12  13  14  15
2013-01-05  16  17  18  19
2013-01-06  20  21  22  23

In [81]:
df[df > 10]

               A     B     C     D
2013-01-01   NaN   NaN   NaN   NaN
2013-01-02   NaN   NaN   NaN   NaN
2013-01-03   NaN   NaN   NaN  11.0
2013-01-04  12.0  13.0  14.0  15.0
2013-01-05  16.0  17.0  18.0  19.0
2013-01-06  20.0  21.0  22.0  23.0

In [83]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']   #添加列

In [84]:
df2

             A   B   C   D      E
2013-01-01   0   1   2   3    one
2013-01-02   4   5   6   7    one
2013-01-03   8   9  10  11    two
2013-01-04  12  13  14  15  three
2013-01-05  16  17  18  19   four
2013-01-06  20  21  22  23  three

In [85]:
df2[df2['E'].isin(['two','four'])]   #查询包含

             A   B   C   D     E
2013-01-03   8   9  10  11   two
2013-01-05  16  17  18  19  four

In [87]:
df[df['C'].isin([10,18])]   #查询包含

             A   B   C   D
2013-01-03   8   9  10  11
2013-01-05  16  17  18  19

In [115]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130101', periods=6))
df2["F"]=s1
df2

             A   B   C   D      E  F
2013-01-01   0   1   2   3    one  1
2013-01-02   4   5   6   7    one  2
2013-01-03   8   9  10  11    two  3
2013-01-04  12  13  14  15  three  4
2013-01-05  16  17  18  19   four  5
2013-01-06  20  21  22  23  three  6

In [117]:
df2.iloc[0]

A      0
B      1
C      2
D      3
E    one
F      1
Name: 2013-01-01 00:00:00, dtype: object

In [125]:
a=np.random.randn(8)
a

array([-3.04509921, -0.64084943, -1.49539017, -0.54440692, -0.57741365,
       -0.77293061,  0.02308348, -0.05692216])

In [132]:
s1 = pd.Series([1,3,5,np.nan,6,8],['A','B','C','D','E','F'])
df2.append(s1,ignore_index=True)

      A     B     C     D      E    F
0   0.0   1.0   2.0   3.0    one  1.0
1   4.0   5.0   6.0   7.0    one  2.0
2   8.0   9.0  10.0  11.0    two  3.0
3  12.0  13.0  14.0  15.0  three  4.0
4  16.0  17.0  18.0  19.0   four  5.0
5  20.0  21.0  22.0  23.0  three  6.0
6   1.0   3.0   5.0   NaN      6  8.0